In [22]:
import pandas as pd
path = "Dataset/sample1.json"

## Reading JSON file

In [9]:
df = pd.read_json(path)
df.head()

    fear       chest    how  graph       camp  plural
0  quiet -1477429467  False  False  929234312  settle

## Getting summary

In [5]:
df.describe()

              chest         camp
count  1.000000e+00          1.0
mean  -1.477429e+09  929234312.0
std             NaN          NaN
min   -1.477429e+09  929234312.0
25%   -1.477429e+09  929234312.0
50%   -1.477429e+09  929234312.0
75%   -1.477429e+09  929234312.0
max   -1.477429e+09  929234312.0

## Info of the DataSet

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1 entries, 0 to 0
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   fear    1 non-null      object
 1   chest   1 non-null      int64
 2   how     1 non-null      bool
 3   graph   1 non-null      bool
 4   camp    1 non-null      int64
 5   plural  1 non-null      object
dtypes: bool(2), int64(2), object(2)
memory usage: 166.0+ bytes

## Shape of DataSet

In [8]:
df.shape

(1, 6)

## Datatype of Particular column

In [10]:
df['chest'].dtype

dtype('int64')

## Getting the sample data

In [11]:
df.sample()

    fear       chest    how  graph       camp  plural
0  quiet -1477429467  False  False  929234312  settle

# Dataset of JSON file 2

In [23]:
path2 = "Dataset/titanic-parquet.json"
df2 = pd.read_json(path2, lines=True)
df2.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,None,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,None,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,None,S

## DESCRIBE()

In [24]:
df2.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

## Info()

In [28]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

## shape()

In [27]:
df2.shape

(891, 12)

## Datatypes in dataset

In [31]:
df2['Name'].dtype

dtype('O')

# Reading .html file

In [36]:
path3 = 'Dataset/flights-1m-parquet.json'
df3 = pd.read_json(path3, lines=True)
df3.head()

      FL_DATE  DEP_DELAY  ARR_DELAY  AIR_TIME  DISTANCE   DEP_TIME   ARR_TIME
0  2006-01-01          5         19       350      2475   9.083333  12.483334
1  2006-01-02        167        216       343      2475  11.783334  15.766666
2  2006-01-03         -7         -2       344      2475   8.883333  12.133333
3  2006-01-04         -5        -13       331      2475   8.916667  11.950000
4  2006-01-05         -3        -17       321      2475   8.950000  11.883333

## describe()

In [37]:
df3.describe()

,DEP_DELAY,ARR_DELAY,AIR_TIME,DISTANCE,DEP_TIME,ARR_TIME
count,1000000.000000,1000000.000000,1000000.00000,1000000.000000,1000000.000000,1000000.000000
mean,8.651135,6.400658,105.81399,741.258545,13.621958,15.134593
std,31.167477,33.939187,69.33634,573.779372,4.737427,4.966053
min,-1197.000000,-197.000000,-2.00000,30.000000,0.000000,0.000000
25%,-4.000000,-10.000000,55.00000,325.000000,9.583333,11.283334
50%,0.000000,-2.000000,87.00000,589.000000,13.583333,15.383333
75%,8.000000,11.000000,136.00000,984.000000,17.500000,19.233334
max,1379.000000,1374.000000,877.00000,4962.000000,23.983334,23.983334

In [38]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 7 columns):
 #   Column     Non-Null Count    Dtype
---  ------     --------------    -----
 0   FL_DATE    1000000 non-null  object
 1   DEP_DELAY  1000000 non-null  int64
 2   ARR_DELAY  1000000 non-null  int64
 3   AIR_TIME   1000000 non-null  int64
 4   DISTANCE   1000000 non-null  int64
 5   DEP_TIME   1000000 non-null  float64
 6   ARR_TIME   1000000 non-null  float64
dtypes: float64(2), int64(4), object(1)
memory usage: 53.4+ MB

In [40]:
df3.shape

(1000000, 7)

# importing api

In [42]:
import requests as rq

In [73]:
data = rq.get("https://fake-json-api.mock.beeceptor.com/companies")
data.json()

[{'id': 1,
  'name': 'Kub - Stehr',
  'address': '6061 Railway Street',
  'zip': '43727',
  'country': 'India',
  'employeeCount': 9098,
  'industry': 'Technology',
  'marketCap': 231971533,
  'domain': 'sniveling-impact.biz',
  'logo': 'https://example.com/logo1.png',
  'ceoName': 'Uriel Tromp'},
 {'id': 2,
  'name': 'Thompson, Schmeler and Bosco',
  'address': '57693 Feest Parkway',
  'zip': '15415',
  'country': 'American Samoa',
  'employeeCount': 7130,
  'industry': 'Technology',
  'marketCap': 836070065,
  'domain': 'neat-kettledrum.name',
  'logo': 'https://example.com/logo1.png',
  'ceoName': 'Rossie Bergstrom'},
 {'id': 3,
  'name': 'Jacobs - Casper',
  'address': '5105 West Avenue',
  'zip': '72705',
  'country': 'Aland Islands',
  'employeeCount': 7851,
  'industry': 'Technology',
  'marketCap': 9779427658,
  'domain': 'pale-ecliptic.biz',
  'logo': 'https://example.com/logo1.png',
  'ceoName': 'Carissa Mann'},
 {'id': 4,
  'name': 'Leffler Inc',
  'address': '48155 Mike Ramp',
  'zip': '94429',
  'country': 'Central African Republic',
  'employeeCount': 8824,
  'industry': 'Technology',
  'marketCap': 9265520948,
  'domain': 'pushy-daddy.org',
  'logo': 'https://example.com/logo1.png',
  'ceoName': 'Kareem Walsh'},
 {'id': 4,
  'name': 'Schinner - Hyatt',
  'address': '572 Bartell Prairie',
  'zip': '85189-9504',
  'country': 'Marshall Islands',
  'employeeCount': 2661,
  'industry': 'Technology',
  'marketCap': 4192751331,
  'domain': 'wicked-cop-out.biz',
  'logo': 'https://example.com/logo1.png',
  'ceoName': 'Easter Leffler'},
 {'id': 5,
  'name': 'Beatty, Lind and Pollich',
  'address': '254 Murray Corners',
  'zip': '69947-6684',
  'country': 'Armenia',
  'employeeCount': 4972,
  'industry': 'Technology',
  'marketCap': 2540771181,
  'domain': 'young-dish.biz',
  'logo': 'https://example.com/logo1.png',
  'ceoName': 'Deven Nitzsche'},
 {'id': 6,
  'name': 'Jacobson Inc',
  'address': '766 Nash Mission',
  'zip': '90757-5142',
  'country': 'Micronesia',
  'employeeCount': 7350,
  'industry': 'Technology',
  'marketCap': 8168817123,
  'domain': 'married-minion.com',
  'logo': 'https://example.com/logo1.png',
  'ceoName': 'Shayna Swaniawski'},
 {'id': 7,
  'name': 'Moore, Wintheiser and Turner',
  'address': '40826 State Avenue',
  'zip': '96154-0289',
  'country': 'Botswana',
  'employeeCount': 871,
  'industry': 'Technology',
  'marketCap': 5918927461,
  'domain': 'scared-breastplate.info',
  'logo': 'https://example.com/logo1.png',
  'ceoName': 'Demarcus Armstrong'},
 {'id': 8,
  'name': 'Gleichner, Miller and Gislason',
  'address': '9826 Woodlands',
  'zip': '44157',
  'country': 'Niger',
  'employeeCount': 3614,
  'industry': 'Technology',
  'marketCap': 8619915771,
  'domain': 'normal-bracelet.biz',
  'logo': 'https://example.com/logo1.png',
  'ceoName': 'Amie O&#x27;Keefe'},
 {'id': 9,
  'name': 'Hermiston LLC',
  'address': '4471 Joesph Points',
  'zip': '26684',
  'country': 'Russian Federation',
  'employeeCount': 8709,
  'industry': 'Technology',
  'marketCap': 2784888711,
  'domain': 'grumpy-pearl.biz',
  'logo': 'https://example.com/logo1.png',
  'ceoName': 'Mackenzie Stoltenberg'},
 {'id': 10,
  'name': 'Kihn and Sons',
  'address': '373 Tudor Close',
  'zip': '72765',
  'country': 'Mozambique',
  'employeeCount': 4413,
  'industry': 'Technology',
  'marketCap': 7128960861,
  'domain': 'aware-markup.biz',
  'logo': 'https://example.com/logo1.png',
  'ceoName': 'Kacie Kemmer'}]

In [65]:
df =pd.DataFrame(data)
df

                                                    0
0   b'[\n  {\n    "id": 1,\n    "name": "Lemke - W...
1   b'Zealand",\n    "employeeCount": 2282,\n    "...
2   b'g",\n    "logo": "https://example.com/logo1....
3   b',\n    "address": "6718 Bednar Skyway",\n   ...
4   b'industry": "Technology",\n    "marketCap": 3...
5   b'ng",\n    "ceoName": "Enrico Wuckert"\n  },\...
6   b'\n    "zip": "09709-0816",\n    "country": "...
7   b'67900,\n    "domain": "dense-farmer.name",\n...
8   b'\n    "id": 4,\n    "name": "King Inc",\n   ...
9   b' of America",\n    "employeeCount": 8773,\n ...
10  b'ling.org",\n    "logo": "https://example.com...
11  b'y, Waters and Kuhn",\n    "address": "255 El...
12  b'7,\n    "industry": "Technology",\n    "mark...
13  b'.com/logo1.png",\n    "ceoName": "Nona Volkm...
14  b'rners",\n    "zip": "15618-1735",\n    "coun...
15  b'Cap": 6285849118,\n    "domain": "unruly-pac...
16  b'er"\n  },\n  {\n    "id": 6,\n    "name": "W...
17  b'ntry": "Saint Vincent and the Grenadines",\n...
18  b'    "domain": "frizzy-violin.name",\n    "lo...
19  b'id": 7,\n    "name": "Sauer - Pagac",\n    "...
20  b',\n    "employeeCount": 6347,\n    "industry...
21  b'go": "https://example.com/logo1.png",\n    "...
22  b'Kuhic",\n    "address": "454 O&#x27;Keefe Gr...
23  b'dustry": "Technology",\n    "marketCap": 933...
24  b'ng",\n    "ceoName": "Beulah Koss-Ritchie"\n...
25  b'",\n    "zip": "36643",\n    "country": "Mex...
26  b'589,\n    "domain": "essential-spirit.name",...
27  b'  "id": 10,\n    "name": "Kozey, Reichel and...
28  b' "Bahamas",\n    "employeeCount": 8381,\n   ...
29  b'm",\n    "logo": "https://example.com/logo1....

## shape

In [63]:
df.shape

(30, 1)

## info()

In [64]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       30 non-null     object
dtypes: object(1)
memory usage: 372.0+ bytes

# api 2

In [68]:
data2 = rq.get('https://api.data.gov.in/resource/8d3b6596-b09e-4077-aebf-425193185a5b?api-key=579b464db66ec23bdd000001cdc3b564546246a772a26393094f5645&offset=0&limit=all&format=csv&format=json')

## Converting to Dataframe

In [70]:
df2 = pd.DataFrame(data2)
df2

                                                      0
0     b'{\n    "index_name": "8d3b6596-b09e-4077-aeb...
1     b': "Monthly Crude Oil Processed by Refineries...
2     b'3-06-22T17:24:31Z",\n    "updated_date": "20...
3     b'"ed4dbe82-439e-4e7f-b217-ce64627a49fc",\n   ...
4     b'f Petroleum and Natural Gas",\n        "Petr...
...                                                 ...
2044  b'ntity_000_metric_tonnes_": "2839.00"\n      ...
2045  b'  "oil_companies_": "RIL-(SEZ), JAMNAGAR,GUJ...
2046  b'         "_month_": "March",\n            "y...
2047  b'ity_000_metric_tonnes_": "1627.00"\n        ...
2048  b'"oil_companies_": "GRAND TOTAL",\n          ...

[2049 rows x 1 columns]

## Describe()

In [71]:
df2.describe()

                                                        0
count                                                2049
unique                                               2047
top     b',\n            "year": "2020",\n            ...
freq                                                    2

## shape

In [72]:
df2.shape

(2049, 1)

## Creating a new Dataframe Varibale to store the 'Records' field data
### converting the DataFrame from .json to .csv file

In [79]:
df3=pd.DataFrame(data2.json()['records'])
df3.to_csv('Dataset/gov.csv')

# imporyting .html file

In [85]:

from bs4 import BeautifulSoup
path4 = 'Dataset/index.html'
df = pd.read_html(path4)
df[0]

            Name  Age      City    Country
0       John Doe   29  New York        USA
1     Jane Smith   34    London         UK
2  Chris Johnson   45   Toronto     Canada
3    Emily Davis   22    Sydney  Australia